jorgebucaran/fisher
ilancosman/tide@v6
catppuccin/fish
edc/bass
jethrokuan/z
franciscolourenco/done
jorgebucaran/replay.fish
joseluisq/gitnow@
jorgebucaran/autopair.fish
nickeb96/puffer-fish
jorgebucaran/nvm.fish
reitzig/sdkman-for-fish@v2.1.0
