# Shell
brew "fish"
brew "atuin"
brew "zoxide"
brew "starship"
brew "direnv"

# Editor
brew "neovim"

# Modern CLI replacements
brew "eza"           # ls
brew "bat"           # cat
brew "fd"            # find
brew "ripgrep"       # grep
brew "sd"            # sed
brew "dust"          # du
brew "duf"           # df
brew "procs"         # ps
brew "bottom"        # top/htop
brew "difftastic"    # diff (structural)
brew "git-delta"     # diff (git pager)
brew "trash-cli"     # rm (safe delete)
brew "choose"        # cut/awk
brew "broot"         # tree explorer
brew "xh"            # curl
brew "doggo"         # dig
brew "gping"         # ping
brew "tealdeer"      # man (tldr)

# Git
brew "git"
brew "git-lfs"
brew "gh"
brew "lazygit"

# Utils
brew "chezmoi"
brew "fzf"
brew "jq"
brew "yq"
brew "shellcheck"
brew "tokei"
brew "hyperfine"
brew "grex"
brew "tmux"
brew "wget"
brew "gnupg"
brew "tree"

# Dev tools
brew "uv"         # Python package manager
brew "node"       # Node.js (includes npx)

# AI Tools
brew "llm"        # Simon Willison's LLM CLI

# macOS-only: GNU tools (Linux has these natively)
if OS.mac?
  brew "coreutils"
  brew "findutils"
  brew "gnu-sed"
  brew "grep"
  brew "moreutils"
end

# Fonts
cask "font-hack-nerd-font" if OS.mac?

# macOS Apps
if OS.mac?
  cask "1password"
  cask "iterm2"
  cask "jetbrains-toolbox"
  cask "visual-studio-code"
  cask "discord"
  cask "vlc"

  # Mac App Store
  brew "mas"
end
